HendrikKleinwaechter/Controller-Board-Names/Arduino-BoardPackage/boards.txt
MinorLenkjoystick.name=Minor Lenkjoystick

MinorLenkjoystick.upload.tool=arduino:avrdude
MinorLenkjoystick.upload.protocol=avr109
MinorLenkjoystick.upload.maximum_size=28672
MinorLenkjoystick.upload.maximum_data_size=2560
MinorLenkjoystick.upload.speed=57600
MinorLenkjoystick.upload.disable_flushing=true
MinorLenkjoystick.upload.use_1200bps_touch=true
MinorLenkjoystick.upload.wait_for_upload_port=true
MinorLenkjoystick.bootloader.tool=arduino:avrdude
MinorLenkjoystick.bootloader.low_fuses=0xff
MinorLenkjoystick.bootloader.high_fuses=0xd8
MinorLenkjoystick.bootloader.extended_fuses=0xcb
MinorLenkjoystick.bootloader.file=caterina/Caterina-Leonardo.hex
MinorLenkjoystick.bootloader.unlock_bits=0x3F
MinorLenkjoystick.bootloader.lock_bits=0x2F
MinorLenkjoystick.build.mcu=atmega32u4
MinorLenkjoystick.build.f_cpu=16000000L
MinorLenkjoystick.build.vid=0x2355
MinorLenkjoystick.build.pid=0x8071
MinorLenkjoystick.build.usb_product="Minor Lenkjoystick"
MinorLenkjoystick.build.usb_manufacturer="Hendrik Kleinwächter"
MinorLenkjoystick.build.board=AVR_LEONARDO
MinorLenkjoystick.build.core=arduino:arduino
MinorLenkjoystick.build.variant=arduino:leonardo
MinorLenkjoystick.build.extra_flags={build.usb_flags}



MinorJoystick.name=Minor Joystick

MinorJoystick.upload.tool=arduino:avrdude
MinorJoystick.upload.protocol=avr109
MinorJoystick.upload.maximum_size=28672
MinorJoystick.upload.maximum_data_size=2560
MinorJoystick.upload.speed=57600
MinorJoystick.upload.disable_flushing=true
MinorJoystick.upload.use_1200bps_touch=true
MinorJoystick.upload.wait_for_upload_port=true
MinorJoystick.bootloader.tool=arduino:avrdude
MinorJoystick.bootloader.low_fuses=0xff
MinorJoystick.bootloader.high_fuses=0xd8
MinorJoystick.bootloader.extended_fuses=0xcb
MinorJoystick.bootloader.file=caterina/Caterina-Leonardo.hex
MinorJoystick.bootloader.unlock_bits=0x3F
MinorJoystick.bootloader.lock_bits=0x2F
MinorJoystick.build.mcu=atmega32u4
MinorJoystick.build.f_cpu=16000000L
MinorJoystick.build.vid=0x2355
MinorJoystick.build.pid=0x8072
MinorJoystick.build.usb_product="Minor Joystick"
MinorJoystick.build.usb_manufacturer="Hendrik Kleinwächter"
MinorJoystick.build.board=AVR_LEONARDO
MinorJoystick.build.core=arduino:arduino
MinorJoystick.build.variant=arduino:leonardo
MinorJoystick.build.extra_flags={build.usb_flags}



MinorSchubhebel.name=Minor Schubhebel

MinorSchubhebel.upload.tool=arduino:avrdude
MinorSchubhebel.upload.protocol=avr109
MinorSchubhebel.upload.maximum_size=28672
MinorSchubhebel.upload.maximum_data_size=2560
MinorSchubhebel.upload.speed=57600
MinorSchubhebel.upload.disable_flushing=true
MinorSchubhebel.upload.use_1200bps_touch=true
MinorSchubhebel.upload.wait_for_upload_port=true
MinorSchubhebel.bootloader.tool=arduino:avrdude
MinorSchubhebel.bootloader.low_fuses=0xff
MinorSchubhebel.bootloader.high_fuses=0xd8
MinorSchubhebel.bootloader.extended_fuses=0xcb
MinorSchubhebel.bootloader.file=caterina/Caterina-Leonardo.hex
MinorSchubhebel.bootloader.unlock_bits=0x3F
MinorSchubhebel.bootloader.lock_bits=0x2F
MinorSchubhebel.build.mcu=atmega32u4
MinorSchubhebel.build.f_cpu=16000000L
MinorSchubhebel.build.vid=0x2355
MinorSchubhebel.build.pid=0x8073
MinorSchubhebel.build.usb_product="Minor Schubhebel"
MinorSchubhebel.build.usb_manufacturer="Hendrik Kleinwächter"
MinorSchubhebel.build.board=AVR_LEONARDO
MinorSchubhebel.build.core=arduino:arduino
MinorSchubhebel.build.variant=arduino:leonardo
MinorSchubhebel.build.extra_flags={build.usb_flags}



VectorLLenkjoystick.name=Vector L Lenkjoystick

VectorLLenkjoystick.upload.tool=arduino:avrdude
VectorLLenkjoystick.upload.protocol=avr109
VectorLLenkjoystick.upload.maximum_size=28672
VectorLLenkjoystick.upload.maximum_data_size=2560
VectorLLenkjoystick.upload.speed=57600
VectorLLenkjoystick.upload.disable_flushing=true
VectorLLenkjoystick.upload.use_1200bps_touch=true
VectorLLenkjoystick.upload.wait_for_upload_port=true
VectorLLenkjoystick.bootloader.tool=arduino:avrdude
VectorLLenkjoystick.bootloader.low_fuses=0xff
VectorLLenkjoystick.bootloader.high_fuses=0xd8
VectorLLenkjoystick.bootloader.extended_fuses=0xcb
VectorLLenkjoystick.bootloader.file=caterina/Caterina-Leonardo.hex
VectorLLenkjoystick.bootloader.unlock_bits=0x3F
VectorLLenkjoystick.bootloader.lock_bits=0x2F
VectorLLenkjoystick.build.mcu=atmega32u4
VectorLLenkjoystick.build.f_cpu=16000000L
VectorLLenkjoystick.build.vid=0x2355
VectorLLenkjoystick.build.pid=0x8074
VectorLLenkjoystick.build.usb_product="Vector L Lenkjoystick"
VectorLLenkjoystick.build.usb_manufacturer="Hendrik Kleinwächter"
VectorLLenkjoystick.build.board=AVR_LEONARDO
VectorLLenkjoystick.build.core=arduino:arduino
VectorLLenkjoystick.build.variant=arduino:leonardo
VectorLLenkjoystick.build.extra_flags={build.usb_flags}



VectorLSchubhebel.name=Vector L Schubhebel

VectorLSchubhebel.upload.tool=arduino:avrdude
VectorLSchubhebel.upload.protocol=avr109
VectorLSchubhebel.upload.maximum_size=28672
VectorLSchubhebel.upload.maximum_data_size=2560
VectorLSchubhebel.upload.speed=57600
VectorLSchubhebel.upload.disable_flushing=true
VectorLSchubhebel.upload.use_1200bps_touch=true
VectorLSchubhebel.upload.wait_for_upload_port=true
VectorLSchubhebel.bootloader.tool=arduino:avrdude
VectorLSchubhebel.bootloader.low_fuses=0xff
VectorLSchubhebel.bootloader.high_fuses=0xd8
VectorLSchubhebel.bootloader.extended_fuses=0xcb
VectorLSchubhebel.bootloader.file=caterina/Caterina-Leonardo.hex
VectorLSchubhebel.bootloader.unlock_bits=0x3F
VectorLSchubhebel.bootloader.lock_bits=0x2F
VectorLSchubhebel.build.mcu=atmega32u4
VectorLSchubhebel.build.f_cpu=16000000L
VectorLSchubhebel.build.vid=0x2355
VectorLSchubhebel.build.pid=0x8075
VectorLSchubhebel.build.usb_product="Vector L Schubhebel"
VectorLSchubhebel.build.usb_manufacturer="Hendrik Kleinwächter"
VectorLSchubhebel.build.board=AVR_LEONARDO
VectorLSchubhebel.build.core=arduino:arduino
VectorLSchubhebel.build.variant=arduino:leonardo
VectorLSchubhebel.build.extra_flags={build.usb_flags}



VectorLJoystickFahrhebel.name=Vector L Joystick Fahrhebel

VectorLJoystickFahrhebel.upload.tool=arduino:avrdude
VectorLJoystickFahrhebel.upload.protocol=avr109
VectorLJoystickFahrhebel.upload.maximum_size=28672
VectorLJoystickFahrhebel.upload.maximum_data_size=2560
VectorLJoystickFahrhebel.upload.speed=57600
VectorLJoystickFahrhebel.upload.disable_flushing=true
VectorLJoystickFahrhebel.upload.use_1200bps_touch=true
VectorLJoystickFahrhebel.upload.wait_for_upload_port=true
VectorLJoystickFahrhebel.bootloader.tool=arduino:avrdude
VectorLJoystickFahrhebel.bootloader.low_fuses=0xff
VectorLJoystickFahrhebel.bootloader.high_fuses=0xd8
VectorLJoystickFahrhebel.bootloader.extended_fuses=0xcb
VectorLJoystickFahrhebel.bootloader.file=caterina/Caterina-Leonardo.hex
VectorLJoystickFahrhebel.bootloader.unlock_bits=0x3F
VectorLJoystickFahrhebel.bootloader.lock_bits=0x2F
VectorLJoystickFahrhebel.build.mcu=atmega32u4
VectorLJoystickFahrhebel.build.f_cpu=16000000L
VectorLJoystickFahrhebel.build.vid=0x2355
VectorLJoystickFahrhebel.build.pid=0x8076
VectorLJoystickFahrhebel.build.usb_product="Vector L Joystick Fahrhebel"
VectorLJoystickFahrhebel.build.usb_manufacturer="Hendrik Kleinwächter"
VectorLJoystickFahrhebel.build.board=AVR_LEONARDO
VectorLJoystickFahrhebel.build.core=arduino:arduino
VectorLJoystickFahrhebel.build.variant=arduino:leonardo
VectorLJoystickFahrhebel.build.extra_flags={build.usb_flags}



VectorRLenkjoystick.name=Vector R Lenkjoystick

VectorRLenkjoystick.upload.tool=arduino:avrdude
VectorRLenkjoystick.upload.protocol=avr109
VectorRLenkjoystick.upload.maximum_size=28672
VectorRLenkjoystick.upload.maximum_data_size=2560
VectorRLenkjoystick.upload.speed=57600
VectorRLenkjoystick.upload.disable_flushing=true
VectorRLenkjoystick.upload.use_1200bps_touch=true
VectorRLenkjoystick.upload.wait_for_upload_port=true
VectorRLenkjoystick.bootloader.tool=arduino:avrdude
VectorRLenkjoystick.bootloader.low_fuses=0xff
VectorRLenkjoystick.bootloader.high_fuses=0xd8
VectorRLenkjoystick.bootloader.extended_fuses=0xcb
VectorRLenkjoystick.bootloader.file=caterina/Caterina-Leonardo.hex
VectorRLenkjoystick.bootloader.unlock_bits=0x3F
VectorRLenkjoystick.bootloader.lock_bits=0x2F
VectorRLenkjoystick.build.mcu=atmega32u4
VectorRLenkjoystick.build.f_cpu=16000000L
VectorRLenkjoystick.build.vid=0x2355
VectorRLenkjoystick.build.pid=0x8077
VectorRLenkjoystick.build.usb_product="Vector R Lenkjoystick"
VectorRLenkjoystick.build.usb_manufacturer="Hendrik Kleinwächter"
VectorRLenkjoystick.build.board=AVR_LEONARDO
VectorRLenkjoystick.build.core=arduino:arduino
VectorRLenkjoystick.build.variant=arduino:leonardo
VectorRLenkjoystick.build.extra_flags={build.usb_flags}



VectorRSchubhebel.name=Vector R Schubhebel

VectorRSchubhebel.upload.tool=arduino:avrdude
VectorRSchubhebel.upload.protocol=avr109
VectorRSchubhebel.upload.maximum_size=28672
VectorRSchubhebel.upload.maximum_data_size=2560
VectorRSchubhebel.upload.speed=57600
VectorRSchubhebel.upload.disable_flushing=true
VectorRSchubhebel.upload.use_1200bps_touch=true
VectorRSchubhebel.upload.wait_for_upload_port=true
VectorRSchubhebel.bootloader.tool=arduino:avrdude
VectorRSchubhebel.bootloader.low_fuses=0xff
VectorRSchubhebel.bootloader.high_fuses=0xd8
VectorRSchubhebel.bootloader.extended_fuses=0xcb
VectorRSchubhebel.bootloader.file=caterina/Caterina-Leonardo.hex
VectorRSchubhebel.bootloader.unlock_bits=0x3F
VectorRSchubhebel.bootloader.lock_bits=0x2F
VectorRSchubhebel.build.mcu=atmega32u4
VectorRSchubhebel.build.f_cpu=16000000L
VectorRSchubhebel.build.vid=0x2355
VectorRSchubhebel.build.pid=0x8078
VectorRSchubhebel.build.usb_product="Vector R Schubhebel"
VectorRSchubhebel.build.usb_manufacturer="Hendrik Kleinwächter"
VectorRSchubhebel.build.board=AVR_LEONARDO
VectorRSchubhebel.build.core=arduino:arduino
VectorRSchubhebel.build.variant=arduino:leonardo
VectorRSchubhebel.build.extra_flags={build.usb_flags}



VectorRJoystickFahrhebel.name=Vector R Joystick Fahrhebel

VectorRJoystickFahrhebel.upload.tool=arduino:avrdude
VectorRJoystickFahrhebel.upload.protocol=avr109
VectorRJoystickFahrhebel.upload.maximum_size=28672
VectorRJoystickFahrhebel.upload.maximum_data_size=2560
VectorRJoystickFahrhebel.upload.speed=57600
VectorRJoystickFahrhebel.upload.disable_flushing=true
VectorRJoystickFahrhebel.upload.use_1200bps_touch=true
VectorRJoystickFahrhebel.upload.wait_for_upload_port=true
VectorRJoystickFahrhebel.bootloader.tool=arduino:avrdude
VectorRJoystickFahrhebel.bootloader.low_fuses=0xff
VectorRJoystickFahrhebel.bootloader.high_fuses=0xd8
VectorRJoystickFahrhebel.bootloader.extended_fuses=0xcb
VectorRJoystickFahrhebel.bootloader.file=caterina/Caterina-Leonardo.hex
VectorRJoystickFahrhebel.bootloader.unlock_bits=0x3F
VectorRJoystickFahrhebel.bootloader.lock_bits=0x2F
VectorRJoystickFahrhebel.build.mcu=atmega32u4
VectorRJoystickFahrhebel.build.f_cpu=16000000L
VectorRJoystickFahrhebel.build.vid=0x2355
VectorRJoystickFahrhebel.build.pid=0x8079
VectorRJoystickFahrhebel.build.usb_product="Vector R Joystick Fahrhebel"
VectorRJoystickFahrhebel.build.usb_manufacturer="Hendrik Kleinwächter"
VectorRJoystickFahrhebel.build.board=AVR_LEONARDO
VectorRJoystickFahrhebel.build.core=arduino:arduino
VectorRJoystickFahrhebel.build.variant=arduino:leonardo
VectorRJoystickFahrhebel.build.extra_flags={build.usb_flags}



AxisFingertipjoystick.name=Axis Fingertipjoystick

AxisFingertipjoystick.upload.tool=arduino:avrdude
AxisFingertipjoystick.upload.protocol=avr109
AxisFingertipjoystick.upload.maximum_size=28672
AxisFingertipjoystick.upload.maximum_data_size=2560
AxisFingertipjoystick.upload.speed=57600
AxisFingertipjoystick.upload.disable_flushing=true
AxisFingertipjoystick.upload.use_1200bps_touch=true
AxisFingertipjoystick.upload.wait_for_upload_port=true
AxisFingertipjoystick.bootloader.tool=arduino:avrdude
AxisFingertipjoystick.bootloader.low_fuses=0xff
AxisFingertipjoystick.bootloader.high_fuses=0xd8
AxisFingertipjoystick.bootloader.extended_fuses=0xcb
AxisFingertipjoystick.bootloader.file=caterina/Caterina-Leonardo.hex
AxisFingertipjoystick.bootloader.unlock_bits=0x3F
AxisFingertipjoystick.bootloader.lock_bits=0x2F
AxisFingertipjoystick.build.mcu=atmega32u4
AxisFingertipjoystick.build.f_cpu=16000000L
AxisFingertipjoystick.build.vid=0x2355
AxisFingertipjoystick.build.pid=0x807A
AxisFingertipjoystick.build.usb_product="Axis Fingertipjoystick"
AxisFingertipjoystick.build.usb_manufacturer="Hendrik Kleinwächter"
AxisFingertipjoystick.build.board=AVR_LEONARDO
AxisFingertipjoystick.build.core=arduino:arduino
AxisFingertipjoystick.build.variant=arduino:leonardo
AxisFingertipjoystick.build.extra_flags={build.usb_flags}



DirectionControlKit.name=Direction Control Kit

DirectionControlKit.upload.tool=arduino:avrdude
DirectionControlKit.upload.protocol=avr109
DirectionControlKit.upload.maximum_size=28672
DirectionControlKit.upload.maximum_data_size=2560
DirectionControlKit.upload.speed=57600
DirectionControlKit.upload.disable_flushing=true
DirectionControlKit.upload.use_1200bps_touch=true
DirectionControlKit.upload.wait_for_upload_port=true
DirectionControlKit.bootloader.tool=arduino:avrdude
DirectionControlKit.bootloader.low_fuses=0xff
DirectionControlKit.bootloader.high_fuses=0xd8
DirectionControlKit.bootloader.extended_fuses=0xcb
DirectionControlKit.bootloader.file=caterina/Caterina-Leonardo.hex
DirectionControlKit.bootloader.unlock_bits=0x3F
DirectionControlKit.bootloader.lock_bits=0x2F
DirectionControlKit.build.mcu=atmega32u4
DirectionControlKit.build.f_cpu=16000000L
DirectionControlKit.build.vid=0x2355
DirectionControlKit.build.pid=0x807B
DirectionControlKit.build.usb_product="Direction Control Kit"
DirectionControlKit.build.usb_manufacturer="Hendrik Kleinwächter"
DirectionControlKit.build.board=AVR_LEONARDO
DirectionControlKit.build.core=arduino:arduino
DirectionControlKit.build.variant=arduino:leonardo
DirectionControlKit.build.extra_flags={build.usb_flags}



DirectusLenkjoystick.name=Directus Lenkjoystick

DirectusLenkjoystick.upload.tool=arduino:avrdude
DirectusLenkjoystick.upload.protocol=avr109
DirectusLenkjoystick.upload.maximum_size=28672
DirectusLenkjoystick.upload.maximum_data_size=2560
DirectusLenkjoystick.upload.speed=57600
DirectusLenkjoystick.upload.disable_flushing=true
DirectusLenkjoystick.upload.use_1200bps_touch=true
DirectusLenkjoystick.upload.wait_for_upload_port=true
DirectusLenkjoystick.bootloader.tool=arduino:avrdude
DirectusLenkjoystick.bootloader.low_fuses=0xff
DirectusLenkjoystick.bootloader.high_fuses=0xd8
DirectusLenkjoystick.bootloader.extended_fuses=0xcb
DirectusLenkjoystick.bootloader.file=caterina/Caterina-Leonardo.hex
DirectusLenkjoystick.bootloader.unlock_bits=0x3F
DirectusLenkjoystick.bootloader.lock_bits=0x2F
DirectusLenkjoystick.build.mcu=atmega32u4
DirectusLenkjoystick.build.f_cpu=16000000L
DirectusLenkjoystick.build.vid=0x2355
DirectusLenkjoystick.build.pid=0x807C
DirectusLenkjoystick.build.usb_product="Directus Lenkjoystick"
DirectusLenkjoystick.build.usb_manufacturer="Hendrik Kleinwächter"
DirectusLenkjoystick.build.board=AVR_LEONARDO
DirectusLenkjoystick.build.core=arduino:arduino
DirectusLenkjoystick.build.variant=arduino:leonardo
DirectusLenkjoystick.build.extra_flags={build.usb_flags}



DirectusJoystickFahrhebel.name=Directus Joystick Fahrhebel

DirectusJoystickFahrhebel.upload.tool=arduino:avrdude
DirectusJoystickFahrhebel.upload.protocol=avr109
DirectusJoystickFahrhebel.upload.maximum_size=28672
DirectusJoystickFahrhebel.upload.maximum_data_size=2560
DirectusJoystickFahrhebel.upload.speed=57600
DirectusJoystickFahrhebel.upload.disable_flushing=true
DirectusJoystickFahrhebel.upload.use_1200bps_touch=true
DirectusJoystickFahrhebel.upload.wait_for_upload_port=true
DirectusJoystickFahrhebel.bootloader.tool=arduino:avrdude
DirectusJoystickFahrhebel.bootloader.low_fuses=0xff
DirectusJoystickFahrhebel.bootloader.high_fuses=0xd8
DirectusJoystickFahrhebel.bootloader.extended_fuses=0xcb
DirectusJoystickFahrhebel.bootloader.file=caterina/Caterina-Leonardo.hex
DirectusJoystickFahrhebel.bootloader.unlock_bits=0x3F
DirectusJoystickFahrhebel.bootloader.lock_bits=0x2F
DirectusJoystickFahrhebel.build.mcu=atmega32u4
DirectusJoystickFahrhebel.build.f_cpu=16000000L
DirectusJoystickFahrhebel.build.vid=0x2355
DirectusJoystickFahrhebel.build.pid=0x807D
DirectusJoystickFahrhebel.build.usb_product="Directus Joystick Fahrhebel"
DirectusJoystickFahrhebel.build.usb_manufacturer="Hendrik Kleinwächter"
DirectusJoystickFahrhebel.build.board=AVR_LEONARDO
DirectusJoystickFahrhebel.build.core=arduino:arduino
DirectusJoystickFahrhebel.build.variant=arduino:leonardo
DirectusJoystickFahrhebel.build.extra_flags={build.usb_flags}



DirectusSchubhebel.name=Directus Schubhebel

DirectusSchubhebel.upload.tool=arduino:avrdude
DirectusSchubhebel.upload.protocol=avr109
DirectusSchubhebel.upload.maximum_size=28672
DirectusSchubhebel.upload.maximum_data_size=2560
DirectusSchubhebel.upload.speed=57600
DirectusSchubhebel.upload.disable_flushing=true
DirectusSchubhebel.upload.use_1200bps_touch=true
DirectusSchubhebel.upload.wait_for_upload_port=true
DirectusSchubhebel.bootloader.tool=arduino:avrdude
DirectusSchubhebel.bootloader.low_fuses=0xff
DirectusSchubhebel.bootloader.high_fuses=0xd8
DirectusSchubhebel.bootloader.extended_fuses=0xcb
DirectusSchubhebel.bootloader.file=caterina/Caterina-Leonardo.hex
DirectusSchubhebel.bootloader.unlock_bits=0x3F
DirectusSchubhebel.bootloader.lock_bits=0x2F
DirectusSchubhebel.build.mcu=atmega32u4
DirectusSchubhebel.build.f_cpu=16000000L
DirectusSchubhebel.build.vid=0x2355
DirectusSchubhebel.build.pid=0x807E
DirectusSchubhebel.build.usb_product="Directus Schubhebel"
DirectusSchubhebel.build.usb_manufacturer="Hendrik Kleinwächter"
DirectusSchubhebel.build.board=AVR_LEONARDO
DirectusSchubhebel.build.core=arduino:arduino
DirectusSchubhebel.build.variant=arduino:leonardo
DirectusSchubhebel.build.extra_flags={build.usb_flags}
